* tasks
** next
   - [ ] populate/tmp-init of categories/tags
   - [ ] parenscript for categories/tags/authors in navigation
   - [ ] db
   - [ ] cache
   - [ ] css
   - [ ] tests
   - [ ] utils/config
   - [X] config
** utils
*** DONE config
    CLOSED: [2012-06-19 Tue 14:47]
    :CLOCK:
    CLOCK: [2012-06-19 Tue 14:27]--[2012-06-19 Tue 14:47] =>  0:20
    CLOCK: [2012-06-18 Mon 15:48]--[2012-06-18 Mon 17:42] =>  1:54
    CLOCK: [2012-06-18 Mon 13:33]--[2012-06-18 Mon 15:06] =>  1:33
    CLOCK: [2012-06-18 Mon 13:07]--[2012-06-18 Mon 13:21] =>  0:14
    CLOCK: [2012-06-18 Mon 11:07]--[2012-06-18 Mon 12:07] =>  1:00
    CLOCK: [2012-06-15 Fri 16:32]--[2012-06-15 Fri 20:04] =>  3:32
    :END:
*** cache
    - w/ time for each with-cache call
    - cache BE calls (especially DB reads)
    - http://static.springsource.org/spring/docs/3.1.0.M1/spring-framework-reference/html/cache.html (Look for @Cacheable, key generation and @CacheEvict)
** TODO frontend
*** misc
    - mini-author class for
      - nav
      - foreign key in article
*** TODO wireframes
    :CLOCK:
    CLOCK: [2012-06-13 Wed 10:40]--[2012-06-13 Wed 10:54] =>  0:14
    :END:
*** TODO routes
    :CLOCK:
	CLOCK: [2012-06-08 Fri 15:11]--[2012-06-08 Fri 16:00] =>  0:49
    CLOCK: [2012-06-08 Fri 13:02]--[2012-06-08 Fri 13:06] =>  0:04
    :END:
    - [X] home
    - [X] home-page
    - [X] cat
    - [X] cat-subcat
    - [X] tag
    - [X] author
    - [X] article
    - [ ] static-files
    - [X] search
*** views
**** common
***** header
****** logo
****** trending
****** TODO navigation
	   :CLOCK:
	   CLOCK: [2012-06-08 Fri 16:44]--[2012-06-08 Fri 16:45] =>  0:01
	   :END:
***** footer
***** ads
***** TODO navigation
      :CLOCK:
      CLOCK: [2012-06-14 Thu 13:46]--[2012-06-14 Thu 15:15] =>  1:29
      CLOCK: [2012-06-13 Wed 11:41]--[2012-06-13 Wed 12:02] =>  0:21
      CLOCK: [2012-06-13 Wed 08:40]--[2012-06-13 Wed 10:40] =>  2:00
      CLOCK: [2012-06-12 Tue 19:26]--[2012-06-12 Tue 20:26] =>  1:00
      :END:
***** DONE pagination
      CLOSED: [2012-06-11 Mon 17:54]
***** TODO #views
      :CLOCK:
      CLOCK: [2012-06-13 Wed 11:14]--[2012-06-13 Wed 11:35] =>  0:21
      CLOCK: [2012-06-13 Wed 10:55]--[2012-06-13 Wed 11:14] =>  0:19
      :END:
**** home
***** latest
***** most-popular
**** article
***** related-carousel
**** cat/subcat
***** list of other cat/subcat
**** author
***** list of other authors
**** tags
***** list of other tags
*** [[*models][models]]
*** DONE template@pencil
     CLOSED: [2012-06-08 Fri 14:35]
    :CLOCK:
    CLOCK: [2012-06-08 Fri 13:59]--[2012-06-08 Fri 14:35] =>  0:36
    :END:
    - [X] template
    - [X] navigation
*** nginx
	- [ ] proxy
	- [ ] static files
	- [ ] caching
*** future requirements/improvements
    - extra (empty), user-settable, primary-navigation fields
      - html5
      - html4 + cookie
    - related articles
      - users who viewed this also viewed
        - http://coding.smashingmagazine.com/2011/03/23/speeding-up-your-websites-database/
          - How Can A Database Slow Down A Website?
          - …Or Just Cheat
** editorial
*** TODO models
	:CLOCK:
    CLOCK: [2012-06-08 Fri 19:07]--[2012-06-08 Fri 20:15] =>  1:08
	CLOCK: [2012-06-08 Fri 17:20]--[2012-06-08 Fri 18:20] =>  1:00
	CLOCK: [2012-06-08 Fri 16:45]--[2012-06-08 Fri 17:11] =>  0:26
	:END:
    - [ ] user
    - [ ] author(user)
    - [ ] category
    - [ ] tag
    - [ ] view
    - [ ] article
*** TODO initial content
    :CLOCK:
    CLOCK: [2012-06-08 Fri 14:43]--[2012-06-08 Fri 14:50] =>  0:07
    :END:
**** categories [fn:1] [fn:2]
     - Sports
       - American Football
       - Badminton
       - Baseball
       - Basketball
       - Boxing
       - Cricket
       - Cycling
       - Hockey
       - Golf
       - Handball
       - Olympics
       - Racing
       - Rugby
       - Table Tennis
       - Tennis
     - Entenrtainment
       - Arts
       - Books
       - Celebrities
       - Movies
       - Music
       - TV
       - Humor
     - Lifestyle
       - Automotive
       - Culture
       - Food and Beverage
       - Home and Garden
       - Theatre
       - Travel
       - Health
     - Technology
       - Computing
       - Internet
       - Personal Technology
       - Video Games
     - Business
       - Companies
       - Economy
       - Industry
       - Markets
     - Education
     - Science
       - Environmenent
       - Geography
       - Space
     - Headlines
     - Politics
     - Religion
** utils
*** html
*** caching
*** db
*** init
*** config
*** l10n
** queue
*** producer (boomerang)
*** consumer (cron)
** reports
** horizontal
*** tests
**** TODO fiveam
     :CLOCK:
     :END:
     - http://msnyder.info/posts/2011/07/lisp-for-the-web-part-ii/#sec-7
     - http://aperiodic.net/phil/archives/Geekery/notes-on-lisp-testing-frameworks.html
     - http://www.cliki.net/test%20framework
**** coverage (sb-cover)
* notes
** restas
   - routes:
	 - trailing 'slash' should be put explicitly, to avoid matching to no/multiple rules
	 - *submodule* and *route* special variables are populated during request, and aren't available from slime
* Footnotes
[fn:1] http://en.wikipedia.org/wiki/Wikipedia:Category
[fn:2] http://support.google.com/webmasters/bin/answer.py?hl=en&answer=42993
